Revit 2027 API
WorksetDefaultVisibilitySettings.SetWorksetVisibility Method
 Set the default visibility of a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetWorksetVisibility(
	WorksetId worksetId,
	bool visible
)
Public Sub SetWorksetVisibility (
	worksetId As WorksetId,
	visible As Boolean
)
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	bool visible
)
member SetWorksetVisibility :
        worksetId : WorksetId *
        visible : bool -> unit
Parameters
worksetId WorksetId
 Id of the workset.
visible Boolean
 Whether the workset should be visible by default or not.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
Example
public void HideWorkset(Document doc, View view, WorksetId worksetId)
{
    // get the current visibility
    WorksetVisibility visibility = view.GetWorksetVisibility(worksetId);
    // and set it to 'Hidden' if it is not hidden yet
    if (visibility != WorksetVisibility.Hidden)
    {
        view.SetWorksetVisibility(worksetId, WorksetVisibility.Hidden);
    }
    // Get the workset’s default visibility
    WorksetDefaultVisibilitySettings defaultVisibility = WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(doc);
    // and making sure it is set to 'false'
    if (defaultVisibility.IsWorksetVisible(worksetId))
    {
        defaultVisibility.SetWorksetVisibility(worksetId, false);
    }
}
See Also
Reference
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace